36/data/attachments/1989186310ec2020.txt

URL: http://www.advantageonlineshopping.com:80/accountservice/ws
SOAP request : 
<x:Envelope xmlns:x="http://schemas.xmlsoap.org/soap/envelope/" xmlns:com="com.advantage.online.store.accountservice">
    <x:Header/>
    <x:Body>
        <com:AccountLoginRequest>
            <com:loginUser>MzfEu</com:loginUser>
            <com:email>MzfEu@email.com</com:email>
            <com:loginPassword>Szsyt735</com:loginPassword>
        </com:AccountLoginRequest>
    </x:Body>
</x:Envelope>
SOAP Response: 
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <ns2:AccountLoginResponse xmlns:ns2="com.advantage.online.store.accountservice">
            <ns2:StatusMessage>
                <ns2:success>true</ns2:success>
                <ns2:userId>789534383</ns2:userId>
                <ns2:reason>Login Successful</ns2:reason>
                <ns2:token>eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpc3MiOiJ3d3cuYWR2YW50YWdlb25saW5lc2hvcHBpbmcuY29tIiwidXNlcklkIjo3ODk1MzQzODMsInN1YiI6Ik16ZkV1Iiwicm9sZSI6IlVTRVIifQ.PvgdOOJxm7OvQQL4RMpxshcwAyCptTG8XBb_4Y5oUzE</ns2:token>
                <ns2:sessionId>18d55cdb243@7E811DF1314^i%789534383</ns2:sessionId>
                <ns2:t_authorization>TXpmRXU6U3pzeXQ3MzU=</ns2:t_authorization>
                <ns2:accountType>20</ns2:accountType>
            </ns2:StatusMessage>
        </ns2:AccountLoginResponse>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
